In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

# 7.1 Handling Missing Data

In [4]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data.isna()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
string_data.notnull()

0     True
1     True
2    False
3     True
dtype: bool

In [8]:
string_data.notna()

0     True
1     True
2    False
3     True
dtype: bool

In [10]:
print(string_data)
string_data[string_data.isnull()]
string_data[string_data.isna()]
string_data[(string_data.isnull()) | (string_data.isna())]

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

2    NaN
dtype: object

In [11]:
print(string_data)
string_data[~string_data.isnull()]
string_data[~string_data.isna()]
string_data[(~string_data.isnull()) | (~string_data.isna())]

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

0     aardvark
1    artichoke
3      avocado
dtype: object

In [12]:
print(string_data)
string_data[string_data.notnull()]
string_data[string_data.notna()]
string_data[(string_data.notnull()) | (string_data.notna())]

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

0     aardvark
1    artichoke
3      avocado
dtype: object

In [13]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [14]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [15]:
string_data.isna()

0     True
1    False
2     True
3    False
dtype: bool

## Table 7-1. NA handling methods

In [16]:
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [18]:
print(string_data)
string_data.dropna()

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

1    artichoke
3      avocado
dtype: object

# Filtering Out Missing Data

In [19]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
print(data)
data.dropna()

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

0    1.0
2    3.5
4    7.0
dtype: float64

In [20]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [21]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [23]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [24]:
print(data)
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [25]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [29]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.572912       NaN       NaN
1 -0.895626       NaN       NaN
2  0.974236       NaN -1.989479
3  1.027522       NaN -0.587219
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

In [30]:
print(df)
df.dropna()

          0         1         2
0 -0.572912       NaN       NaN
1 -0.895626       NaN       NaN
2  0.974236       NaN -1.989479
3  1.027522       NaN -0.587219
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

          0         1         2
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

In [32]:
print(df)
df.dropna(thresh=2)

          0         1         2
0 -0.572912       NaN       NaN
1 -0.895626       NaN       NaN
2  0.974236       NaN -1.989479
3  1.027522       NaN -0.587219
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

          0         1         2
2  0.974236       NaN -1.989479
3  1.027522       NaN -0.587219
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

In [36]:
df[(df[1].notnull())]

          0         1         2
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

## Filling In Missing Data

In [37]:
df

          0         1         2
0 -0.572912       NaN       NaN
1 -0.895626       NaN       NaN
2  0.974236       NaN -1.989479
3  1.027522       NaN -0.587219
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

In [38]:
print(df)
df.fillna(0)

          0         1         2
0 -0.572912       NaN       NaN
1 -0.895626       NaN       NaN
2  0.974236       NaN -1.989479
3  1.027522       NaN -0.587219
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

          0         1         2
0 -0.572912  0.000000  0.000000
1 -0.895626  0.000000  0.000000
2  0.974236  0.000000 -1.989479
3  1.027522  0.000000 -0.587219
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

In [39]:
df.fillna({1:5, 2:7})

          0         1         2
0 -0.572912  5.000000  7.000000
1 -0.895626  5.000000  7.000000
2  0.974236  5.000000 -1.989479
3  1.027522  5.000000 -0.587219
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

In [42]:
print(df.mean())
df.fillna(df.mean())

0   -0.175829
1   -0.159435
2   -0.522448
dtype: float64

          0         1         2
0 -0.572912 -0.159435 -0.522448
1 -0.895626 -0.159435 -0.522448
2  0.974236 -0.159435 -1.989479
3  1.027522 -0.159435 -0.587219
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

In [43]:
df

          0         1         2
0 -0.572912       NaN       NaN
1 -0.895626       NaN       NaN
2  0.974236       NaN -1.989479
3  1.027522       NaN -0.587219
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

In [44]:
df.fillna(df.mean(), inplace=True)

In [45]:
df

          0         1         2
0 -0.572912 -0.159435 -0.522448
1 -0.895626 -0.159435 -0.522448
2  0.974236 -0.159435 -1.989479
3  1.027522 -0.159435 -0.587219
4 -0.278506 -0.773305 -0.779209
5 -1.607480  0.428635 -0.327336
6  0.121959 -0.133635  1.071005

In [48]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:-1, 1] = NA
df.iloc[3:-1, 2] = NA

df

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414       NaN -1.525482
3  2.138853       NaN       NaN
4  0.361466       NaN       NaN
5 -1.790641 -1.625916  0.024016

In [49]:
print(df)
df.fillna(method='ffill')

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414       NaN -1.525482
3  2.138853       NaN       NaN
4  0.361466       NaN       NaN
5 -1.790641 -1.625916  0.024016

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414  0.041461 -1.525482
3  2.138853  0.041461 -1.525482
4  0.361466  0.041461 -1.525482
5 -1.790641 -1.625916  0.024016

In [50]:
print(df)
df.fillna(method='bfill')

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414       NaN -1.525482
3  2.138853       NaN       NaN
4  0.361466       NaN       NaN
5 -1.790641 -1.625916  0.024016

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414 -1.625916 -1.525482
3  2.138853 -1.625916  0.024016
4  0.361466 -1.625916  0.024016
5 -1.790641 -1.625916  0.024016

In [51]:
print(df)
df.fillna(method='ffill', axis=1)

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414       NaN -1.525482
3  2.138853       NaN       NaN
4  0.361466       NaN       NaN
5 -1.790641 -1.625916  0.024016

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414 -1.783414 -1.525482
3  2.138853  2.138853  2.138853
4  0.361466  0.361466  0.361466
5 -1.790641 -1.625916  0.024016

In [52]:
print(df)
df.fillna(method='bfill', axis=1)

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414       NaN -1.525482
3  2.138853       NaN       NaN
4  0.361466       NaN       NaN
5 -1.790641 -1.625916  0.024016

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414 -1.525482 -1.525482
3  2.138853       NaN       NaN
4  0.361466       NaN       NaN
5 -1.790641 -1.625916  0.024016

In [53]:
print(df)
df.fillna(method='ffill', limit=2)

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414       NaN -1.525482
3  2.138853       NaN       NaN
4  0.361466       NaN       NaN
5 -1.790641 -1.625916  0.024016

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414  0.041461 -1.525482
3  2.138853  0.041461 -1.525482
4  0.361466       NaN -1.525482
5 -1.790641 -1.625916  0.024016

In [54]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [56]:
print(df)
df.fillna(2)
df.fillna(value=2)

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414       NaN -1.525482
3  2.138853       NaN       NaN
4  0.361466       NaN       NaN
5 -1.790641 -1.625916  0.024016

          0         1         2
0  1.519422  0.160851  0.704004
1  0.451904  0.041461 -1.902933
2 -1.783414  2.000000 -1.525482
3  2.138853  2.000000  2.000000
4  0.361466  2.000000  2.000000
5 -1.790641 -1.625916  0.024016

In [62]:
df[2].isna().sum() / len(df)

0.3333333333333333

# 7.2 Data Transformation

## Removing Duplicates

In [57]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [63]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [64]:
data[data.duplicated()]

    k1  k2
6  two   4

In [65]:
data[~data.duplicated()]

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [66]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [67]:
data.drop_duplicates(subset="k1")

    k1  k2
0  one   1
1  two   1

In [68]:
data.drop_duplicates(subset=["k1",'k2'])

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [69]:
data['v1'] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [70]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [71]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [72]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [73]:
meat_to_animal = {
 'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'
}
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [74]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [75]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [77]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

## Replacing Values

In [78]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [79]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [80]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [81]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [82]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## Renaming Axis Indexes

In [83]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [84]:
transform = lambda x: x[:4].upper()

In [85]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [86]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [87]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [90]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [91]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

## Discretization and Binning

In [93]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
slab = [18,25,40,60,120]

cat = pd.cut(ages, slab)
cat

[(18, 25], (18, 25], (18, 25], (25, 40], (18, 25], ..., (25, 40], (60, 120], (40, 60], (40, 60], (25, 40]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 40] < (40, 60] < (60, 120]]

In [94]:
cat.codes

array([0, 0, 0, 1, 0, 0, 1, 1, 3, 2, 2, 1], dtype=int8)

In [95]:
cat.categories

IntervalIndex([(18, 25], (25, 40], (40, 60], (60, 120]],
              closed='right',
              dtype='interval[int64]')

In [96]:
cat.value_counts()

(18, 25]     5
(25, 40]     4
(40, 60]     2
(60, 120]    1
dtype: int64

In [97]:
pd.cut(ages, slab,right=False)

[[18, 25), [18, 25), [25, 40), [25, 40), [18, 25), ..., [25, 40), [60, 120), [40, 60), [40, 60), [25, 40)]
Length: 12
Categories (4, interval[int64]): [[18, 25) < [25, 40) < [40, 60) < [60, 120)]

In [98]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, slab,right=False, labels=group_names)

[Youth, Youth, YoungAdult, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [100]:
data = np.random.rand(20)
pd.cut(data,4).value_counts()

(0.0432, 0.279]    3
(0.279, 0.514]     6
(0.514, 0.748]     3
(0.748, 0.983]     8
dtype: int64

In [106]:
data = np.random.randn(1000) # Normally distribut
cats = pd.qcut(data, 4) # Cut into quartiles
cats.value_counts()

(-2.6719999999999997, -0.634]    250
(-0.634, 0.0128]                 250
(0.0128, 0.656]                  250
(0.656, 3.087]                   250
dtype: int64

In [108]:
pd.qcut(data, [0,.1, .4, .7, 1]).value_counts()

(-2.6719999999999997, -1.32]    100
(-1.32, -0.245]                 300
(-0.245, 0.501]                 300
(0.501, 3.087]                  300
dtype: int64

# Detecting and Filtering Outliers

In [109]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.026852     0.004152     0.045912    -0.000521
std       0.996633     1.002402     0.982907     1.013698
min      -3.814995    -3.179195    -2.801545    -3.306253
25%      -0.623434    -0.673773    -0.644449    -0.674137
50%       0.005256     0.008046     0.045728     0.009155
75%       0.681104     0.631754     0.706802     0.673209
max       3.125245     3.352365     3.211923     3.476086

In [110]:
col = data[2]
col

0     -1.666930
1      0.098160
2      0.889703
3     -0.712264
4     -0.036302
         ...
995   -0.922939
996   -0.030337
997   -1.628738
998   -0.396577
999    1.320330
Name: 2, Length: 1000, dtype: float64

In [111]:
col[np.abs(col) > 3]

340    3.211923
347    3.159968
Name: 2, dtype: float64

In [112]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
171  3.125245 -0.511147 -1.204394 -0.762351
221  1.310247  0.496506 -1.065768 -3.292343
272 -0.176473  0.434266  0.872243 -3.108708
300 -3.044199 -0.162408 -1.036904  1.152428
340  1.669273 -0.068263  3.211923 -2.048441
347  2.155585 -0.387555  3.159968 -0.703138
652  3.057494  0.322947  2.660515 -0.502255
670  1.682280  3.040520  0.820684  0.460881
828 -3.814995  0.137341  1.406870 -2.398559
885  1.011214 -1.245577  0.669296  3.476086
913  1.035967 -0.539081 -0.794766 -3.306253
939 -0.468953  3.352365  1.477727 -0.098911
955 -0.683350 -3.179195 -0.877304  2.479147
975  0.233757  3.037499 -0.392639 -0.511670

In [113]:
data[np.abs(data) > 3] = np.sign(data) * 3
data

            0         1         2         3
0   -0.185997 -1.984483 -1.666930  0.930354
1   -0.518777  0.401362  0.098160  0.730277
2    0.103558 -0.113518  0.889703 -0.246225
3    0.979450 -0.080273 -0.712264 -0.162991
4    0.395216 -1.207483 -0.036302 -1.549586
..        ...       ...       ...       ...
995 -1.032182  0.686207 -0.922939 -0.788503
996 -0.160061  1.516310 -0.030337  0.332903
997 -0.411915  0.963837 -1.628738 -1.740135
998  0.108912 -0.221179 -0.396577 -0.013862
999 -1.766656  1.058305  1.320330 -0.510937

[1000 rows x 4 columns]

In [114]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.027529     0.003901     0.045540    -0.000289
std       0.993125     1.000495     0.981751     1.009979
min      -3.000000    -3.000000    -2.801545    -3.000000
25%      -0.623434    -0.673773    -0.644449    -0.674137
50%       0.005256     0.008046     0.045728     0.009155
75%       0.681104     0.631754     0.706802     0.673209
max       3.000000     3.000000     3.000000     3.000000

In [115]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0 -1.0  1.0
1 -1.0  1.0  1.0  1.0
2  1.0 -1.0  1.0 -1.0
3  1.0 -1.0 -1.0 -1.0
4  1.0 -1.0 -1.0 -1.0

## Permutation and Random Sampling

In [116]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [117]:
sampler = np.random.permutation(5)
sampler

array([1, 3, 0, 4, 2])

In [118]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19
2   8   9  10  11

In [119]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [120]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

2   -1
3    6
0    5
0    5
2   -1
0    5
2   -1
2   -1
0    5
1    7
dtype: int64

In [124]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=3)
draws

1    7
0    5
4    4
dtype: int64

## Computing Indicator/Dummy Variables

In [128]:
a = pd.DataFrame({"key":["A","A","B","C","A","C","A","B"]})
a

  key
0   A
1   A
2   B
3   C
4   A
5   C
6   A
7   B

In [130]:
pd.get_dummies(a.key)

   A  B  C
0  1  0  0
1  1  0  0
2  0  1  0
3  0  0  1
4  1  0  0
5  0  0  1
6  1  0  0
7  0  1  0